{"format": "layers-model", "generatedBy": "keras v2.15.0", "convertedBy": "TensorFlow.js Converter v4.17.0", "modelTopology": {"keras_version": "2.15.0", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential_1", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 224, 224, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "feature_extraction_layer_input"}}, {"class_name": "KerasLayer", "config": {"name": "feature_extraction_layer", "trainable": false, "dtype": "float32", "batch_input_shape": [null, 224, 224, 3], "handle": "https://tfhub.dev/tensorflow/efficientnet/b0/feature-vector/1"}}, {"class_name": "Dense", "config": {"name": "output_layer", "trainable": true, "dtype": "float32", "units": 20, "activation": "softmax", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}, "training_config": {"loss": "categorical_crossentropy", "metrics": [[{"class_name": "MeanMetricWrapper", "config": {"name": "accuracy", "dtype": "float32", "fn": "categorical_accuracy"}}]], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Custom>Adam", "config": {"name": "Adam", "weight_decay": null, "clipnorm": null, "global_clipnorm": null, "clipvalue": null, "use_ema": false, "ema_momentum": 0.99, "ema_overwrite_frequency": null, "jit_compile": false, "is_legacy_optimizer": false, "learning_rate": 0.0010000000474974513, "beta_1": 0.9, "beta_2": 0.999, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of4.bin", "group1-shard2of4.bin", "group1-shard3of4.bin", "group1-shard4of4.bin"], "weights": [{"name": "stem_conv2d/kernel", "shape": [3, 3, 3, 32], "dtype": "float32"}, {"name": "stem_bn/gamma", "shape": [32], "dtype": "float32"}, {"name": "stem_bn/beta", "shape": [32], "dtype": "float32"}, {"name": "stack_0/block_0/depthwise_conv2d/depthwise_kernel", "shape": [3, 3, 32, 1], "dtype": "float32"}, {"name": "stack_0/block_0/depthwise_bn/gamma", "shape": [32], "dtype": "float32"}, {"name": "stack_0/block_0/depthwise_bn/beta", "shape": [32], "dtype": "float32"}, {"name": "stack_0/block_0/se_reduce_conv2d/kernel", "shape": [1, 1, 32, 8], "dtype": "float32"}, {"name": "stack_0/block_0/se_reduce_conv2d/bias", "shape": [8], "dtype": "float32"}, {"name": "stack_0/block_0/se_expand_conv2d/kernel", "shape": [1, 1, 8, 32], "dtype": "float32"}, {"name": "stack_0/block_0/se_expand_conv2d/bias", "shape": [32], "dtype": "float32"}, {"name": "stack_0/block_0/project_conv2d/kernel", "shape": [1, 1, 32, 16], "dtype": "float32"}, {"name": "stack_0/block_0/project_bn/gamma", "shape": [16], "dtype": "float32"}, {"name": "stack_0/block_0/project_bn/beta", "shape": [16], "dtype": "float32"}, {"name": "stack_1/block_0/expand_conv2d/kernel", "shape": [1, 1, 16, 96], "dtype": "float32"}, {"name": "stack_1/block_0/expand_bn/gamma", "shape": [96], "dtype": "float32"}, {"name": "stack_1/block_0/expand_bn/beta", "shape": [96], "dtype": "float32"}, {"name": "stack_1/block_0/depthwise_conv2d/depthwise_kernel", "shape": [3, 3, 96, 1], "dtype": "float32"}, {"name": "stack_1/block_0/depthwise_bn/gamma", "shape": [96], "dtype": "float32"}, {"name": "stack_1/block_0/depthwise_bn/beta", "shape": [96], "dtype": "float32"}, {"name": "stack_1/block_0/se_reduce_conv2d/kernel", "shape": [1, 1, 96, 4], "dtype": "float32"}, {"name": "stack_1/block_0/se_reduce_conv2d/bias", "shape": [4], "dtype": "float32"}, {"name": "stack_1/block_0/se_expand_conv2d/kernel", "shape": [1, 1, 4, 96], "dtype": "float32"}, {"name": "stack_1/block_0/se_expand_conv2d/bias", "shape": [96], "dtype": "float32"}, {"name": "stack_1/block_0/project_conv2d/kernel", "shape": [1, 1, 96, 24], "dtype": "float32"}, {"name": "stack_1/block_0/project_bn/gamma", "shape": [24], "dtype": "float32"}, {"name": "stack_1/block_0/project_bn/beta", "shape": [24], "dtype": "float32"}, {"name": "stack_1/block_1/expand_conv2d/kernel", "shape": [1, 1, 24, 144], "dtype": "float32"}, {"name": "stack_1/block_1/expand_bn/gamma", "shape": [144], "dtype": "float32"}, {"name": "stack_1/block_1/expand_bn/beta", "shape": [144], "dtype": "float32"}, {"name": "stack_1/block_1/depthwise_conv2d/depthwise_kernel", "shape": [3, 3, 144, 1], "dtype": "float32"}, {"name": "stack_1/block_1/depthwise_bn/gamma", "shape": [144], "dtype": "float32"}, {"name": "stack_1/block_1/depthwise_bn/beta", "shape": [144], "dtype": "float32"}, {"name": "stack_1/block_1/se_reduce_conv2d/kernel", "shape": [1, 1, 144, 6], "dtype": "float32"}, {"name": "stack_1/block_1/se_reduce_conv2d/bias", "shape": [6], "dtype": "float32"}, {"name": "stack_1/block_1/se_expand_conv2d/kernel", "shape": [1, 1, 6, 144], "dtype": "float32"}, {"name": "stack_1/block_1/se_expand_conv2d/bias", "shape": [144], "dtype": "float32"}, {"name": "stack_1/block_1/project_conv2d/kernel", "shape": [1, 1, 144, 24], "dtype": "float32"}, {"name": "stack_1/block_1/project_bn/gamma", "shape": [24], "dtype": "float32"}, {"name": "stack_1/block_1/project_bn/beta", "shape": [24], "dtype": "float32"}, {"name": "stack_2/block_0/expand_conv2d/kernel", "shape": [1, 1, 24, 144], "dtype": "float32"}, {"name": "stack_2/block_0/expand_bn/gamma", "shape": [144], "dtype": "float32"}, {"name": "stack_2/block_0/expand_bn/beta", "shape": [144], "dtype": "float32"}, {"name": "stack_2/block_0/depthwise_conv2d/depthwise_kernel", "shape": [5, 5, 144, 1], "dtype": "float32"}, {"name": "stack_2/block_0/depthwise_bn/gamma", "shape": [144], "dtype": "float32"}, {"name": "stack_2/block_0/depthwise_bn/beta", "shape": [144], "dtype": "float32"}, {"name": "stack_2/block_0/se_reduce_conv2d/kernel", "shape": [1, 1, 144, 6], "dtype": "float32"}, {"name": "stack_2/block_0/se_reduce_conv2d/bias", "shape": [6], "dtype": "float32"}, {"name": "stack_2/block_0/se_expand_conv2d/kernel", "shape": [1, 1, 6, 144], "dtype": "float32"}, {"name": "stack_2/block_0/se_expand_conv2d/bias", "shape": [144], "dtype": "float32"}, {"name": "stack_2/block_0/project_conv2d/kernel", "shape": [1, 1, 144, 40], "dtype": "float32"}, {"name": "stack_2/block_0/project_bn/gamma", "shape": [40], "dtype": "float32"}, {"name": "stack_2/block_0/project_bn/beta", "shape": [40], "dtype": "float32"}, {"name": "stack_2/block_1/expand_conv2d/kernel", "shape": [1, 1, 40, 240], "dtype": "float32"}, {"name": "stack_2/block_1/expand_bn/gamma", "shape": [240], "dtype": "float32"}, {"name": "stack_2/block_1/expand_bn/beta", "shape": [240], "dtype": "float32"}, {"name": "stack_2/block_1/depthwise_conv2d/depthwise_kernel", "shape": [5, 5, 240, 1], "dtype": "float32"}, {"name": "stack_2/block_1/depthwise_bn/gamma", "shape": [240], "dtype": "float32"}, {"name": "stack_2/block_1/depthwise_bn/beta", "shape": [240], "dtype": "float32"}, {"name": "stack_2/block_1/se_reduce_conv2d/kernel", "shape": [1, 1, 240, 10], "dtype": "float32"}, {"name": "stack_2/block_1/se_reduce_conv2d/bias", "shape": [10], "dtype": "float32"}, {"name": "stack_2/block_1/se_expand_conv2d/kernel", "shape": [1, 1, 10, 240], "dtype": "float32"}, {"name": "stack_2/block_1/se_expand_conv2d/bias", "shape": [240], "dtype": "float32"}, {"name": "stack_2/block_1/project_conv2d/kernel", "shape": [1, 1, 240, 40], "dtype": "float32"}, {"name": "stack_2/block_1/project_bn/gamma", "shape": [40], "dtype": "float32"}, {"name": "stack_2/block_1/project_bn/beta", "shape": [40], "dtype": "float32"}, {"name": "stack_3/block_0/expand_conv2d/kernel", "shape": [1, 1, 40, 240], "dtype": "float32"}, {"name": "stack_3/block_0/expand_bn/gamma", "shape": [240], "dtype": "float32"}, {"name": "stack_3/block_0/expand_bn/beta", "shape": [240], "dtype": "float32"}, {"name": "stack_3/block_0/depthwise_conv2d/depthwise_kernel", "shape": [3, 3, 240, 1], "dtype": "float32"}, {"name": "stack_3/block_0/depthwise_bn/gamma", "shape": [240], "dtype": "float32"}, {"name": "stack_3/block_0/depthwise_bn/beta", "shape": [240], "dtype": "float32"}, {"name": "stack_3/block_0/se_reduce_conv2d/kernel", "shape": [1, 1, 240, 10], "dtype": "float32"}, {"name": "stack_3/block_0/se_reduce_conv2d/bias", "shape": [10], "dtype": "float32"}, {"name": "stack_3/block_0/se_expand_conv2d/kernel", "shape": [1, 1, 10, 240], "dtype": "float32"}, {"name": "stack_3/block_0/se_expand_conv2d/bias", "shape": [240], "dtype": "float32"}, {"name": "stack_3/block_0/project_conv2d/kernel", "shape": [1, 1, 240, 80], "dtype": "float32"}, {"name": "stack_3/block_0/project_bn/gamma", "shape": [80], "dtype": "float32"}, {"name": "stack_3/block_0/project_bn/beta", "shape": [80], "dtype": "float32"}, {"name": "stack_3/block_1/expand_conv2d/kernel", "shape": [1, 1, 80, 480], "dtype": "float32"}, {"name": "stack_3/block_1/expand_bn/gamma", "shape": [480], "dtype": "float32"}, {"name": "stack_3/block_1/expand_bn/beta", "shape": [480], "dtype": "float32"}, {"name": "stack_3/block_1/depthwise_conv2d/depthwise_kernel", "shape": [3, 3, 480, 1], "dtype": "float32"}, {"name": "stack_3/block_1/depthwise_bn/gamma", "shape": [480], "dtype": "float32"}, {"name": "stack_3/block_1/depthwise_bn/beta", "shape": [480], "dtype": "float32"}, {"name": "stack_3/block_1/se_reduce_conv2d/kernel", "shape": [1, 1, 480, 20], "dtype": "float32"}, {"name": "stack_3/block_1/se_reduce_conv2d/bias", "shape": [20], "dtype": "float32"}, {"name": "stack_3/block_1/se_expand_conv2d/kernel", "shape": [1, 1, 20, 480], "dtype": "float32"}, {"name": "stack_3/block_1/se_expand_conv2d/bias", "shape": [480], "dtype": "float32"}, {"name": "stack_3/block_1/project_conv2d/kernel", "shape": [1, 1, 480, 80], "dtype": "float32"}, {"name": "stack_3/block_1/project_bn/gamma", "shape": [80], "dtype": "float32"}, {"name": "stack_3/block_1/project_bn/beta", "shape": [80], "dtype": "float32"}, {"name": "stack_3/block_2/expand_conv2d/kernel", "shape": [1, 1, 80, 480], "dtype": "float32"}, {"name": "stack_3/block_2/expand_bn/gamma", "shape": [480], "dtype": "float32"}, {"name": "stack_3/block_2/expand_bn/beta", "shape": [480], "dtype": "float32"}, {"name": "stack_3/block_2/depthwise_conv2d/depthwise_kernel", "shape": [3, 3, 480, 1], "dtype": "float32"}, {"name": "stack_3/block_2/depthwise_bn/gamma", "shape": [480], "dtype": "float32"}, {"name": "stack_3/block_2/depthwise_bn/beta", "shape": [480], "dtype": "float32"}, {"name": "stack_3/block_2/se_reduce_conv2d/kernel", "shape": [1, 1, 480, 20], "dtype": "float32"}, {"name": "stack_3/block_2/se_reduce_conv2d/bias", "shape": [20], "dtype": "float32"}, {"name": "stack_3/block_2/se_expand_conv2d/kernel", "shape": [1, 1, 20, 480], "dtype": "float32"}, {"name": "stack_3/block_2/se_expand_conv2d/bias", "shape": [480], "dtype": "float32"}, {"name": "stack_3/block_2/project_conv2d/kernel", "shape": [1, 1, 480, 80], "dtype": "float32"}, {"name": "stack_3/block_2/project_bn/gamma", "shape": [80], "dtype": "float32"}, {"name": "stack_3/block_2/project_bn/beta", "shape": [80], "dtype": "float32"}, {"name": "stack_4/block_0/expand_conv2d/kernel", "shape": [1, 1, 80, 480], "dtype": "float32"}, {"name": "stack_4/block_0/expand_bn/gamma", "shape": [480], "dtype": "float32"}, {"name": "stack_4/block_0/expand_bn/beta", "shape": [480], "dtype": "float32"}, {"name": "stack_4/block_0/depthwise_conv2d/depthwise_kernel", "shape": [5, 5, 480, 1], "dtype": "float32"}, {"name": "stack_4/block_0/depthwise_bn/gamma", "shape": [480], "dtype": "float32"}, {"name": "stack_4/block_0/depthwise_bn/beta", "shape": [480], "dtype": "float32"}, {"name": "stack_4/block_0/se_reduce_conv2d/kernel", "shape": [1, 1, 480, 20], "dtype": "float32"}, {"name": "stack_4/block_0/se_reduce_conv2d/bias", "shape": [20], "dtype": "float32"}, {"name": "stack_4/block_0/se_expand_conv2d/kernel", "shape": [1, 1, 20, 480], "dtype": "float32"}, {"name": "stack_4/block_0/se_expand_conv2d/bias", "shape": [480], "dtype": "float32"}, {"name": "stack_4/block_0/project_conv2d/kernel", "shape": [1, 1, 480, 112], "dtype": "float32"}, {"name": "stack_4/block_0/project_bn/gamma", "shape": [112], "dtype": "float32"}, {"name": "stack_4/block_0/project_bn/beta", "shape": [112], "dtype": "float32"}, {"name": "stack_4/block_1/expand_conv2d/kernel", "shape": [1, 1, 112, 672], "dtype": "float32"}, {"name": "stack_4/block_1/expand_bn/gamma", "shape": [672], "dtype": "float32"}, {"name": "stack_4/block_1/expand_bn/beta", "shape": [672], "dtype": "float32"}, {"name": "stack_4/block_1/depthwise_conv2d/depthwise_kernel", "shape": [5, 5, 672, 1], "dtype": "float32"}, {"name": "stack_4/block_1/depthwise_bn/gamma", "shape": [672], "dtype": "float32"}, {"name": "stack_4/block_1/depthwise_bn/beta", "shape": [672], "dtype": "float32"}, {"name": "stack_4/block_1/se_reduce_conv2d/kernel", "shape": [1, 1, 672, 28], "dtype": "float32"}, {"name": "stack_4/block_1/se_reduce_conv2d/bias", "shape": [28], "dtype": "float32"}, {"name": "stack_4/block_1/se_expand_conv2d/kernel", "shape": [1, 1, 28, 672], "dtype": "float32"}, {"name": "stack_4/block_1/se_expand_conv2d/bias", "shape": [672], "dtype": "float32"}, {"name": "stack_4/block_1/project_conv2d/kernel", "shape": [1, 1, 672, 112], "dtype": "float32"}, {"name": "stack_4/block_1/project_bn/gamma", "shape": [112], "dtype": "float32"}, {"name": "stack_4/block_1/project_bn/beta", "shape": [112], "dtype": "float32"}, {"name": "stack_4/block_2/expand_conv2d/kernel", "shape": [1, 1, 112, 672], "dtype": "float32"}, {"name": "stack_4/block_2/expand_bn/gamma", "shape": [672], "dtype": "float32"}, {"name": "stack_4/block_2/expand_bn/beta", "shape": [672], "dtype": "float32"}, {"name": "stack_4/block_2/depthwise_conv2d/depthwise_kernel", "shape": [5, 5, 672, 1], "dtype": "float32"}, {"name": "stack_4/block_2/depthwise_bn/gamma", "shape": [672], "dtype": "float32"}, {"name": "stack_4/block_2/depthwise_bn/beta", "shape": [672], "dtype": "float32"}, {"name": "stack_4/block_2/se_reduce_conv2d/kernel", "shape": [1, 1, 672, 28], "dtype": "float32"}, {"name": "stack_4/block_2/se_reduce_conv2d/bias", "shape": [28], "dtype": "float32"}, {"name": "stack_4/block_2/se_expand_conv2d/kernel", "shape": [1, 1, 28, 672], "dtype": "float32"}, {"name": "stack_4/block_2/se_expand_conv2d/bias", "shape": [672], "dtype": "float32"}, {"name": "stack_4/block_2/project_conv2d/kernel", "shape": [1, 1, 672, 112], "dtype": "float32"}, {"name": "stack_4/block_2/project_bn/gamma", "shape": [112], "dtype": "float32"}, {"name": "stack_4/block_2/project_bn/beta", "shape": [112], "dtype": "float32"}, {"name": "stack_5/block_0/expand_conv2d/kernel", "shape": [1, 1, 112, 672], "dtype": "float32"}, {"name": "stack_5/block_0/expand_bn/gamma", "shape": [672], "dtype": "float32"}, {"name": "stack_5/block_0/expand_bn/beta", "shape": [672], "dtype": "float32"}, {"name": "stack_5/block_0/depthwise_conv2d/depthwise_kernel", "shape": [5, 5, 672, 1], "dtype": "float32"}, {"name": "stack_5/block_0/depthwise_bn/gamma", "shape": [672], "dtype": "float32"}, {"name": "stack_5/block_0/depthwise_bn/beta", "shape": [672], "dtype": "float32"}, {"name": "stack_5/block_0/se_reduce_conv2d/kernel", "shape": [1, 1, 672, 28], "dtype": "float32"}, {"name": "stack_5/block_0/se_reduce_conv2d/bias", "shape": [28], "dtype": "float32"}, {"name": "stack_5/block_0/se_expand_conv2d/kernel", "shape": [1, 1, 28, 672], "dtype": "float32"}, {"name": "stack_5/block_0/se_expand_conv2d/bias", "shape": [672], "dtype": "float32"}, {"name": "stack_5/block_0/project_conv2d/kernel", "shape": [1, 1, 672, 192], "dtype": "float32"}, {"name": "stack_5/block_0/project_bn/gamma", "shape": [192], "dtype": "float32"}, {"name": "stack_5/block_0/project_bn/beta", "shape": [192], "dtype": "float32"}, {"name": "stack_5/block_1/expand_conv2d/kernel", "shape": [1, 1, 192, 1152], "dtype": "float32"}, {"name": "stack_5/block_1/expand_bn/gamma", "shape": [1152], "dtype": "float32"}, {"name": "stack_5/block_1/expand_bn/beta", "shape": [1152], "dtype": "float32"}, {"name": "stack_5/block_1/depthwise_conv2d/depthwise_kernel", "shape": [5, 5, 1152, 1], "dtype": "float32"}, {"name": "stack_5/block_1/depthwise_bn/gamma", "shape": [1152], "dtype": "float32"}, {"name": "stack_5/block_1/depthwise_bn/beta", "shape": [1152], "dtype": "float32"}, {"name": "stack_5/block_1/se_reduce_conv2d/kernel", "shape": [1, 1, 1152, 48], "dtype": "float32"}, {"name": "stack_5/block_1/se_reduce_conv2d/bias", "shape": [48], "dtype": "float32"}, {"name": "stack_5/block_1/se_expand_conv2d/kernel", "shape": [1, 1, 48, 1152], "dtype": "float32"}, {"name": "stack_5/block_1/se_expand_conv2d/bias", "shape": [1152], "dtype": "float32"}, {"name": "stack_5/block_1/project_conv2d/kernel", "shape": [1, 1, 1152, 192], "dtype": "float32"}, {"name": "stack_5/block_1/project_bn/gamma", "shape": [192], "dtype": "float32"}, {"name": "stack_5/block_1/project_bn/beta", "shape": [192], "dtype": "float32"}, {"name": "stack_5/block_2/expand_conv2d/kernel", "shape": [1, 1, 192, 1152], "dtype": "float32"}, {"name": "stack_5/block_2/expand_bn/gamma", "shape": [1152], "dtype": "float32"}, {"name": "stack_5/block_2/expand_bn/beta", "shape": [1152], "dtype": "float32"}, {"name": "stack_5/block_2/depthwise_conv2d/depthwise_kernel", "shape": [5, 5, 1152, 1], "dtype": "float32"}, {"name": "stack_5/block_2/depthwise_bn/gamma", "shape": [1152], "dtype": "float32"}, {"name": "stack_5/block_2/depthwise_bn/beta", "shape": [1152], "dtype": "float32"}, {"name": "stack_5/block_2/se_reduce_conv2d/kernel", "shape": [1, 1, 1152, 48], "dtype": "float32"}, {"name": "stack_5/block_2/se_reduce_conv2d/bias", "shape": [48], "dtype": "float32"}, {"name": "stack_5/block_2/se_expand_conv2d/kernel", "shape": [1, 1, 48, 1152], "dtype": "float32"}, {"name": "stack_5/block_2/se_expand_conv2d/bias", "shape": [1152], "dtype": "float32"}, {"name": "stack_5/block_2/project_conv2d/kernel", "shape": [1, 1, 1152, 192], "dtype": "float32"}, {"name": "stack_5/block_2/project_bn/gamma", "shape": [192], "dtype": "float32"}, {"name": "stack_5/block_2/project_bn/beta", "shape": [192], "dtype": "float32"}, {"name": "stack_5/block_3/expand_conv2d/kernel", "shape": [1, 1, 192, 1152], "dtype": "float32"}, {"name": "stack_5/block_3/expand_bn/gamma", "shape": [1152], "dtype": "float32"}, {"name": "stack_5/block_3/expand_bn/beta", "shape": [1152], "dtype": "float32"}, {"name": "stack_5/block_3/depthwise_conv2d/depthwise_kernel", "shape": [5, 5, 1152, 1], "dtype": "float32"}, {"name": "stack_5/block_3/depthwise_bn/gamma", "shape": [1152], "dtype": "float32"}, {"name": "stack_5/block_3/depthwise_bn/beta", "shape": [1152], "dtype": "float32"}, {"name": "stack_5/block_3/se_reduce_conv2d/kernel", "shape": [1, 1, 1152, 48], "dtype": "float32"}, {"name": "stack_5/block_3/se_reduce_conv2d/bias", "shape": [48], "dtype": "float32"}, {"name": "stack_5/block_3/se_expand_conv2d/kernel", "shape": [1, 1, 48, 1152], "dtype": "float32"}, {"name": "stack_5/block_3/se_expand_conv2d/bias", "shape": [1152], "dtype": "float32"}, {"name": "stack_5/block_3/project_conv2d/kernel", "shape": [1, 1, 1152, 192], "dtype": "float32"}, {"name": "stack_5/block_3/project_bn/gamma", "shape": [192], "dtype": "float32"}, {"name": "stack_5/block_3/project_bn/beta", "shape": [192], "dtype": "float32"}, {"name": "stack_6/block_0/expand_conv2d/kernel", "shape": [1, 1, 192, 1152], "dtype": "float32"}, {"name": "stack_6/block_0/expand_bn/gamma", "shape": [1152], "dtype": "float32"}, {"name": "stack_6/block_0/expand_bn/beta", "shape": [1152], "dtype": "float32"}, {"name": "stack_6/block_0/depthwise_conv2d/depthwise_kernel", "shape": [3, 3, 1152, 1], "dtype": "float32"}, {"name": "stack_6/block_0/depthwise_bn/gamma", "shape": [1152], "dtype": "float32"}, {"name": "stack_6/block_0/depthwise_bn/beta", "shape": [1152], "dtype": "float32"}, {"name": "stack_6/block_0/se_reduce_conv2d/kernel", "shape": [1, 1, 1152, 48], "dtype": "float32"}, {"name": "stack_6/block_0/se_reduce_conv2d/bias", "shape": [48], "dtype": "float32"}, {"name": "stack_6/block_0/se_expand_conv2d/kernel", "shape": [1, 1, 48, 1152], "dtype": "float32"}, {"name": "stack_6/block_0/se_expand_conv2d/bias", "shape": [1152], "dtype": "float32"}, {"name": "stack_6/block_0/project_conv2d/kernel", "shape": [1, 1, 1152, 320], "dtype": "float32"}, {"name": "stack_6/block_0/project_bn/gamma", "shape": [320], "dtype": "float32"}, {"name": "stack_6/block_0/project_bn/beta", "shape": [320], "dtype": "float32"}, {"name": "top_conv2d/kernel", "shape": [1, 1, 320, 1280], "dtype": "float32"}, {"name": "top_bn/gamma", "shape": [1280], "dtype": "float32"}, {"name": "top_bn/beta", "shape": [1280], "dtype": "float32"}, {"name": "stem_bn/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "stem_bn/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "stack_0/block_0/depthwise_bn/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "stack_0/block_0/depthwise_bn/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "stack_0/block_0/project_bn/moving_mean", "shape": [16], "dtype": "float32"}, {"name": "stack_0/block_0/project_bn/moving_variance", "shape": [16], "dtype": "float32"}, {"name": "stack_1/block_0/expand_bn/moving_mean", "shape": [96], "dtype": "float32"}, {"name": "stack_1/block_0/expand_bn/moving_variance", "shape": [96], "dtype": "float32"}, {"name": "stack_1/block_0/depthwise_bn/moving_mean", "shape": [96], "dtype": "float32"}, {"name": "stack_1/block_0/depthwise_bn/moving_variance", "shape": [96], "dtype": "float32"}, {"name": "stack_1/block_0/project_bn/moving_mean", "shape": [24], "dtype": "float32"}, {"name": "stack_1/block_0/project_bn/moving_variance", "shape": [24], "dtype": "float32"}, {"name": "stack_1/block_1/expand_bn/moving_mean", "shape": [144], "dtype": "float32"}, {"name": "stack_1/block_1/expand_bn/moving_variance", "shape": [144], "dtype": "float32"}, {"name": "stack_1/block_1/depthwise_bn/moving_mean", "shape": [144], "dtype": "float32"}, {"name": "stack_1/block_1/depthwise_bn/moving_variance", "shape": [144], "dtype": "float32"}, {"name": "stack_1/block_1/project_bn/moving_mean", "shape": [24], "dtype": "float32"}, {"name": "stack_1/block_1/project_bn/moving_variance", "shape": [24], "dtype": "float32"}, {"name": "stack_2/block_0/expand_bn/moving_mean", "shape": [144], "dtype": "float32"}, {"name": "stack_2/block_0/expand_bn/moving_variance", "shape": [144], "dtype": "float32"}, {"name": "stack_2/block_0/depthwise_bn/moving_mean", "shape": [144], "dtype": "float32"}, {"name": "stack_2/block_0/depthwise_bn/moving_variance", "shape": [144], "dtype": "float32"}, {"name": "stack_2/block_0/project_bn/moving_mean", "shape": [40], "dtype": "float32"}, {"name": "stack_2/block_0/project_bn/moving_variance", "shape": [40], "dtype": "float32"}, {"name": "stack_2/block_1/expand_bn/moving_mean", "shape": [240], "dtype": "float32"}, {"name": "stack_2/block_1/expand_bn/moving_variance", "shape": [240], "dtype": "float32"}, {"name": "stack_2/block_1/depthwise_bn/moving_mean", "shape": [240], "dtype": "float32"}, {"name": "stack_2/block_1/depthwise_bn/moving_variance", "shape": [240], "dtype": "float32"}, {"name": "stack_2/block_1/project_bn/moving_mean", "shape": [40], "dtype": "float32"}, {"name": "stack_2/block_1/project_bn/moving_variance", "shape": [40], "dtype": "float32"}, {"name": "stack_3/block_0/expand_bn/moving_mean", "shape": [240], "dtype": "float32"}, {"name": "stack_3/block_0/expand_bn/moving_variance", "shape": [240], "dtype": "float32"}, {"name": "stack_3/block_0/depthwise_bn/moving_mean", "shape": [240], "dtype": "float32"}, {"name": "stack_3/block_0/depthwise_bn/moving_variance", "shape": [240], "dtype": "float32"}, {"name": "stack_3/block_0/project_bn/moving_mean", "shape": [80], "dtype": "float32"}, {"name": "stack_3/block_0/project_bn/moving_variance", "shape": [80], "dtype": "float32"}, {"name": "stack_3/block_1/expand_bn/moving_mean", "shape": [480], "dtype": "float32"}, {"name": "stack_3/block_1/expand_bn/moving_variance", "shape": [480], "dtype": "float32"}, {"name": "stack_3/block_1/depthwise_bn/moving_mean", "shape": [480], "dtype": "float32"}, {"name": "stack_3/block_1/depthwise_bn/moving_variance", "shape": [480], "dtype": "float32"}, {"name": "stack_3/block_1/project_bn/moving_mean", "shape": [80], "dtype": "float32"}, {"name": "stack_3/block_1/project_bn/moving_variance", "shape": [80], "dtype": "float32"}, {"name": "stack_3/block_2/expand_bn/moving_mean", "shape": [480], "dtype": "float32"}, {"name": "stack_3/block_2/expand_bn/moving_variance", "shape": [480], "dtype": "float32"}, {"name": "stack_3/block_2/depthwise_bn/moving_mean", "shape": [480], "dtype": "float32"}, {"name": "stack_3/block_2/depthwise_bn/moving_variance", "shape": [480], "dtype": "float32"}, {"name": "stack_3/block_2/project_bn/moving_mean", "shape": [80], "dtype": "float32"}, {"name": "stack_3/block_2/project_bn/moving_variance", "shape": [80], "dtype": "float32"}, {"name": "stack_4/block_0/expand_bn/moving_mean", "shape": [480], "dtype": "float32"}, {"name": "stack_4/block_0/expand_bn/moving_variance", "shape": [480], "dtype": "float32"}, {"name": "stack_4/block_0/depthwise_bn/moving_mean", "shape": [480], "dtype": "float32"}, {"name": "stack_4/block_0/depthwise_bn/moving_variance", "shape": [480], "dtype": "float32"}, {"name": "stack_4/block_0/project_bn/moving_mean", "shape": [112], "dtype": "float32"}, {"name": "stack_4/block_0/project_bn/moving_variance", "shape": [112], "dtype": "float32"}, {"name": "stack_4/block_1/expand_bn/moving_mean", "shape": [672], "dtype": "float32"}, {"name": "stack_4/block_1/expand_bn/moving_variance", "shape": [672], "dtype": "float32"}, {"name": "stack_4/block_1/depthwise_bn/moving_mean", "shape": [672], "dtype": "float32"}, {"name": "stack_4/block_1/depthwise_bn/moving_variance", "shape": [672], "dtype": "float32"}, {"name": "stack_4/block_1/project_bn/moving_mean", "shape": [112], "dtype": "float32"}, {"name": "stack_4/block_1/project_bn/moving_variance", "shape": [112], "dtype": "float32"}, {"name": "stack_4/block_2/expand_bn/moving_mean", "shape": [672], "dtype": "float32"}, {"name": "stack_4/block_2/expand_bn/moving_variance", "shape": [672], "dtype": "float32"}, {"name": "stack_4/block_2/depthwise_bn/moving_mean", "shape": [672], "dtype": "float32"}, {"name": "stack_4/block_2/depthwise_bn/moving_variance", "shape": [672], "dtype": "float32"}, {"name": "stack_4/block_2/project_bn/moving_mean", "shape": [112], "dtype": "float32"}, {"name": "stack_4/block_2/project_bn/moving_variance", "shape": [112], "dtype": "float32"}, {"name": "stack_5/block_0/expand_bn/moving_mean", "shape": [672], "dtype": "float32"}, {"name": "stack_5/block_0/expand_bn/moving_variance", "shape": [672], "dtype": "float32"}, {"name": "stack_5/block_0/depthwise_bn/moving_mean", "shape": [672], "dtype": "float32"}, {"name": "stack_5/block_0/depthwise_bn/moving_variance", "shape": [672], "dtype": "float32"}, {"name": "stack_5/block_0/project_bn/moving_mean", "shape": [192], "dtype": "float32"}, {"name": "stack_5/block_0/project_bn/moving_variance", "shape": [192], "dtype": "float32"}, {"name": "stack_5/block_1/expand_bn/moving_mean", "shape": [1152], "dtype": "float32"}, {"name": "stack_5/block_1/expand_bn/moving_variance", "shape": [1152], "dtype": "float32"}, {"name": "stack_5/block_1/depthwise_bn/moving_mean", "shape": [1152], "dtype": "float32"}, {"name": "stack_5/block_1/depthwise_bn/moving_variance", "shape": [1152], "dtype": "float32"}, {"name": "stack_5/block_1/project_bn/moving_mean", "shape": [192], "dtype": "float32"}, {"name": "stack_5/block_1/project_bn/moving_variance", "shape": [192], "dtype": "float32"}, {"name": "stack_5/block_2/expand_bn/moving_mean", "shape": [1152], "dtype": "float32"}, {"name": "stack_5/block_2/expand_bn/moving_variance", "shape": [1152], "dtype": "float32"}, {"name": "stack_5/block_2/depthwise_bn/moving_mean", "shape": [1152], "dtype": "float32"}, {"name": "stack_5/block_2/depthwise_bn/moving_variance", "shape": [1152], "dtype": "float32"}, {"name": "stack_5/block_2/project_bn/moving_mean", "shape": [192], "dtype": "float32"}, {"name": "stack_5/block_2/project_bn/moving_variance", "shape": [192], "dtype": "float32"}, {"name": "stack_5/block_3/expand_bn/moving_mean", "shape": [1152], "dtype": "float32"}, {"name": "stack_5/block_3/expand_bn/moving_variance", "shape": [1152], "dtype": "float32"}, {"name": "stack_5/block_3/depthwise_bn/moving_mean", "shape": [1152], "dtype": "float32"}, {"name": "stack_5/block_3/depthwise_bn/moving_variance", "shape": [1152], "dtype": "float32"}, {"name": "stack_5/block_3/project_bn/moving_mean", "shape": [192], "dtype": "float32"}, {"name": "stack_5/block_3/project_bn/moving_variance", "shape": [192], "dtype": "float32"}, {"name": "stack_6/block_0/expand_bn/moving_mean", "shape": [1152], "dtype": "float32"}, {"name": "stack_6/block_0/expand_bn/moving_variance", "shape": [1152], "dtype": "float32"}, {"name": "stack_6/block_0/depthwise_bn/moving_mean", "shape": [1152], "dtype": "float32"}, {"name": "stack_6/block_0/depthwise_bn/moving_variance", "shape": [1152], "dtype": "float32"}, {"name": "stack_6/block_0/project_bn/moving_mean", "shape": [320], "dtype": "float32"}, {"name": "stack_6/block_0/project_bn/moving_variance", "shape": [320], "dtype": "float32"}, {"name": "top_bn/moving_mean", "shape": [1280], "dtype": "float32"}, {"name": "top_bn/moving_variance", "shape": [1280], "dtype": "float32"}, {"name": "output_layer/kernel", "shape": [1280, 20], "dtype": "float32"}, {"name": "output_layer/bias", "shape": [20], "dtype": "float32"}]}]}